// НЕ РЕАЛИЗОВАНО Из-за дефектов платформы (панель команд не создается программно). ТУДУ!
// Создает поле форматированного документа вместе с командной панелью форматирования. 
// И поле, и командная панель помещаются в общую группу для корректной работы видимости/доступности.
//
// Параметры:
//  МассивОписаний	 - Массив - 
//  ИмяКомпонента	 - Строка - 
//  Заголовок		 - Строка - 
//  РодительЭлемента - 	 - 
//  ПередЭлементом	 - 	 - 
//  Параметры		 - 	 - 
//  Действия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ДобавитьОписание(МассивОписаний, ИмяКомпонента, Заголовок = "", РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено, Действия = Неопределено) Экспорт  
	А1Э_Формы.ДобавитьОписаниеВертикальнойГруппы(МассивОписаний, ИмяКомпонента, , РодительЭлемента, ПередЭлементом, Параметры, Действия); 
	
	//ТУДУ: Исключить наследуемые параметры (видимость, доступность и т. д.), которые уже назначены группе.
	А1Э_Формы.ДобавитьОписаниеФорматированногоДокумента(МассивОписаний, ИмяОсновногоПоля(ИмяКомпонента), Заголовок, ИмяКомпонента, , Параметры);
	//Добавляем панель после потому что иначе она не создастся т. к. источник команд еще не существует.
	А1Э_Формы.ДобавитьОписаниеГруппы(МассивОписаний, ИмяКоманднойПанели(ИмяКомпонента), , ИмяКомпонента, ИмяОсновногоПоля(ИмяКомпонента), А1Э_Структуры.Создать(
	"Вид", ВидГруппыФормы.КоманднаяПанель,
	"ИсточникКоманд", ИмяОсновногоПоля(ИмяКомпонента),
	));
КонецФункции

Функция ИмяОсновногоПоля(ИмяКомпонента) Экспорт
	Возврат ИмяКомпонента + "___ОсновноеПоле";
КонецФункции

Функция ИмяКоманднойПанели(ИмяКомпонента) Экспорт
	Возврат ИмяКомпонента + "___КоманднаяПанель";
КонецФункции 