Функция ДобавитьОписание(МассивОписаний, ИмяКомпонента, ЗаголовокИстина, ЗаголовокЛожь, Действия = Неопределено, РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено) Экспорт 
	НастройкиКомпонента = А1Э_Структуры.Создать(
	"Заголовки", А1Э_Структуры.СоздатьСоответствие(Истина, ЗаголовокИстина, Ложь, ЗаголовокЛожь)
	);
	
	А1Э_УниверсальнаяФорма.ДобавитьОписаниеНастроекКомпонента(МассивОписаний, ИмяКомпонента, НастройкиКомпонента);
	А1Э_Формы.ДобавитьОписаниеРеквизита(МассивОписаний, ИмяКомпонента, "Булево");
	ДействияКомпонента = А1Э_УниверсальнаяФорма.Обработчики(Действия);
	ДействияКомпонента.Вставить(0, "А1БК_БулеваяКнопка.ОбработчикНажатия");
	СобытияФормыКомпонента = А1Э_Структуры.Создать(
	"ФормаОбновитьСвойстваЭлементов", "А1БК_БулеваяКнопка.ФормаОбновитьСвойстваЭлементов",
	);
	А1Э_Формы.ДобавитьОписаниеКомандыИКнопки(МассивОписаний, ИмяКомпонента, ДействияКомпонента, Ложь, , РодительЭлемента, ПередЭлементом, , Параметры, СобытияФормыКомпонента);   	
КонецФункции

Функция Установить(Форма, ИмяКомпонента, Знач Значение) Экспорт
	Если ТипЗнч(Значение) <> Тип("Булево") Тогда Значение = Ложь; КонецЕсли;
	
	Форма[ИмяКомпонента] = Значение;
	ФормаОбновитьСвойстваЭлементов(ИмяКомпонента, Форма);
КонецФункции 

Функция Переключить(Форма, ИмяКомпонента) Экспорт
	Установить(Форма, ИмяКомпонента, НЕ Форма[ИмяКомпонента]);
КонецФункции

#Область Служебно

Функция ОбработчикНажатия(Форма, Команда) Экспорт
	ИмяКомпонента = Команда.Имя;
	Переключить(Форма, ИмяКомпонента);
КонецФункции 

Функция ФормаОбновитьСвойстваЭлементов(ИмяКомпонента, Форма) Экспорт
	Настройки = А1Э_УниверсальнаяФорма.НастройкиКомпонента(Форма, ИмяКомпонента); 
	Форма.Элементы[ИмяКомпонента].Заголовок = Настройки.Заголовки[Форма[ИмяКомпонента]];
КонецФункции

#КонецОбласти 

