#Если НЕ Клиент Тогда
	
	Функция ДобавитьОписание(МассивОписаний, ИмяКомпонента, Заголовок = "", РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Знач Параметры = Неопределено, Знач Действия = Неопределено) Экспорт 
		РабочиеПараметры = А1Э_Структуры.Скопировать(Параметры);
		РабочиеДействия = А1Э_Структуры.Скопировать(Действия);
		А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаПриСозданииНаСервере"); 
		А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаПередЗаписьюНаСервере");
		
		Настройки = А1Э_Структуры.Создать(
		"ИмяРеквизита", А1Э_Структуры.ЗначениеСвойства(РабочиеПараметры, "ИмяРеквизита", ИмяКомпонента));
		
		А1Э_УниверсальнаяФорма.ДобавитьОписаниеНастроекКомпонента(МассивОписаний, ИмяКомпонента, Настройки);
		
		//Попытка использования А1БК_ПолеФорматированногоДокумента - неудачная.
		//А1БК_ПолеФорматированногоДокумента.ДобавитьОписание(МассивОписаний, ИмяКомпонента, Заголовок, РодительЭлемента, ПередЭлементом, РабочиеПараметры, РабочиеДействия);
		А1Э_Формы.ДобавитьОписаниеФорматированногоДокумента(МассивОписаний, ИмяКомпонента, Заголовок, РодительЭлемента, ПередЭлементом, РабочиеПараметры, РабочиеДействия);
	КонецФункции
	
	#Область Служебно
	
	Функция ФормаПриСозданииНаСервере(ИмяКомпонента, Форма, Отказ, СтандартнаяОбработка) Экспорт
		Настройки = А1Э_УниверсальнаяФорма.НастройкиКомпонента(Форма, ИмяКомпонента);
		//А1Э_ФорматированныйДокумент.УстановитьНТМЛ(Форма[А1БК_ПолеФорматированногоДокумента.ИмяОсновногоПоля(ИмяКомпонента)], А1Э_ФорматированныйДокумент.СсылкаНаИсточник(Форма)[Настройки.ИмяРеквизита].Получить());
		А1Э_ФорматированныйДокумент.УстановитьНТМЛ(Форма[ИмяКомпонента], А1Э_ФорматированныйДокумент.СсылкаНаИсточник(Форма)[Настройки.ИмяРеквизита].Получить());
	КонецФункции
	
	Функция ФормаПередЗаписьюНаСервере(ИмяКомпонента, Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт 
		Настройки = А1Э_УниверсальнаяФорма.НастройкиКомпонента(Форма, ИмяКомпонента);
		
		//ТекущийОбъект[Настройки.ИмяРеквизита] = Новый ХранилищеЗначения(А1Э_ФорматированныйДокумент.СтруктураНТМЛ(Форма[А1БК_ПолеФорматированногоДокумента.ИмяОсновногоПоля(ИмяКомпонента)]));
		ТекущийОбъект[Настройки.ИмяРеквизита] = Новый ХранилищеЗначения(А1Э_ФорматированныйДокумент.СтруктураНТМЛ(Форма[ИмяКомпонента]));
	КонецФункции
	
	#КонецОбласти
	
#КонецЕсли

Функция ИмяМодуля() Экспорт
	Возврат "А1БК_СохраняемоеПолеФорматированногоДокумента";	
КонецФункции 