Функция ВключитьСохранениеВНастройкахПриСозданииНаСервере(ИмяКомпонента, Форма, Отказ, СтандартнаяОбработка) Экспорт
	А1Э_Формы.ВключитьСохранениеВНастройках(Форма);
КонецФункции

Функция ДобавитьОбработчикВключенияСохраненияВНастройках(Действия) Экспорт
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикКДействиям(Действия, "ФормаПриСозданииНаСервере", "А1БК_Общее.ВключитьСохранениеВНастройкахПриСозданииНаСервере");
КонецФункции 

#Область ЗаполнениеНастроек
Функция ЗаполнитьНастройки(НастройкиКомпонента, Параметры, ИмяМодуля) Экспорт
	Если 
		НЕ ТипЗнч(Параметры) = Тип("Структура") И
		НЕ ТипЗнч(Параметры) = Тип("ФиксированнаяСтруктура")
		Тогда
		Возврат("Параметры");
	КонецЕсли;
	
	НастройкиПараметров = А1Э_Общее.РезультатФункции(ИмяМодуля + ".НастройкиПараметров");
	
	Если А1Э_Структуры.Свойство(НастройкиПараметров, "Обязательные") Тогда
		Для Каждого Параметр Из НастройкиПараметров.Обязательные Цикл
			Значение = А1Э_Структуры.ЗначениеСвойства(Параметры, Параметр);
			Если ТипЗнч(Значение) = Тип("Структура") Тогда
				Значение_ = Значение;
				Значение = Новый Структура;
				А1Э_Структуры.СкопироватьСвойства(Значение, Значение_);
			КонецЕсли;
			Если Значение = Неопределено Тогда
				Возврат Параметр;
			КонецЕсли;
			Если А1Э_Структуры.Свойство(НастройкиКомпонента, Параметр) Тогда
				НастройкиКомпонента.Удалить(Параметр);
			КонецЕсли;
			НастройкиКомпонента.Вставить(Параметр, Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если А1Э_Структуры.Свойство(НастройкиПараметров, "ПоУмолчанию") Тогда
		Для Каждого Пара Из НастройкиПараметров.ПоУмолчанию Цикл
			Значение = А1Э_Структуры.ЗначениеСвойства(Параметры, Пара.Ключ);
			Если ТипЗнч(Значение) = Тип("Структура") Тогда
				Значение_ = Значение;
				Значение = Новый Структура;
				А1Э_Структуры.СкопироватьСвойства(Значение, Значение_);
			КонецЕсли;
			Если Значение = Неопределено Тогда
				Значение = Пара.Значение;
			КонецЕсли;
			Если А1Э_Структуры.Свойство(НастройкиКомпонента, Пара.Ключ) Тогда
				НастройкиКомпонента.Удалить(Пара.Ключ);
			КонецЕсли;
			НастройкиКомпонента.Вставить(Пара.Ключ, Значение);
		КонецЦикла;
	КонецЕсли;
	
	Если А1Э_Структуры.Свойство(НастройкиПараметров, "Дополнительные") Тогда
		Для Каждого Параметр Из НастройкиПараметров.Дополнительные Цикл
			Значение = А1Э_Структуры.ЗначениеСвойства(Параметры, Параметр);
			Если ТипЗнч(Значение) = Тип("Структура") Тогда
				Значение_ = Значение;
				Значение = Новый Структура;
				А1Э_Структуры.СкопироватьСвойства(Значение, Значение_);
			КонецЕсли;
			Если Значение = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			Если А1Э_Структуры.Свойство(НастройкиКомпонента, Параметр) Тогда
				НастройкиКомпонента.Удалить(Параметр);
			КонецЕсли;
			НастройкиКомпонента.Вставить(Параметр, Значение);
		КонецЦикла;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции
#КонецОбласти