Функция ДобавитьОписание(МассивОписаний, ИмяКомпонента, ОписаниеТипов, Заголовок = "", РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено, Действия = Неопределено) Экспорт
	РабочиеДействия = А1Э_Структуры.Скопировать(Действия);
	А1БК_Общее.ДобавитьОбработчикВключенияСохраненияВНастройках(РабочиеДействия);
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаПередЗагрузкойДанныхИзНастроекНаСервере", 0);
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаПриСохраненииДанныхВНастройкахНаСервере", 0);
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ПриИзменении");
	Возврат А1Э_Формы.ДобавитьОписаниеРеквизитаИЭлемента(МассивОписаний, ИмяКомпонента, ОписаниеТипов, , Заголовок, РодительЭлемента, ПередЭлементом, Параметры, РабочиеДействия); 
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ФормаПередЗагрузкойДанныхИзНастроекНаСервере(ИмяКомпонента, Форма, Настройки) Экспорт 
		Если ЗначениеЗаполнено(Форма[ИмяКомпонента]) 
			И Форма[ИмяКомпонента] <> Ложь //ЗначениеЗаполнено для Ложь возвращает Истина, фиксим это поведение.
		Тогда Возврат Неопределено; КонецЕсли;
		
		Если Настройки[ИмяКомпонента] <> Неопределено Тогда
			Форма[ИмяКомпонента] = Настройки[ИмяКомпонента];
		КонецЕсли;
	КонецФункции
	
	Функция ФормаПриСохраненииДанныхВНастройкахНаСервере(ИмяКомпонента, Форма, Настройки) Экспорт   
		Настройки.Вставить(ИмяКомпонента, Форма[ИмяКомпонента]);
	КонецФункции
	
#КонецЕсли
#Если Клиент Тогда
	
	Функция ПриИзменении(Форма, Элемент) Экспорт
		Форма.СохраняемыеВНастройкахДанныеМодифицированы = Истина;
	КонецФункции 
	
#КонецЕсли
 
Функция ИмяМодуля() Экспорт
	Возврат "А1БК_СохраняемоеПоле";
КонецФункции 
