// Добавляет дерево формы с дополнительным функционалом:
// 1. В настройках компонента сохраняются ПутиКДанным колонок.
// 2. При двойном клике на колонку с видом ТолькоПросмотр открывается её значение.
//
// Параметры:
//  МассивОписаний	 - Массив -  
//  Имя				 - Строка - 
//  Колонки			 - Массив - 
//  Заголовок		 - Строка - 
//  РодительЭлемента - ЭлементФормы,Строка,Неопределено - 
//  ПередЭлементом	 - ЭлементФормы,Строка,Неопределено - 
//  Параметры		 - Структура,Неопределено - 
//  Действия		 - Структура,Неопределено - 
// 
// Возвращаемое значение:
//  ОписаниеТаблицы - Структура
//
Функция ДобавитьОписание(МассивОписаний, ИмяКомпонента, Знач Колонки, Заголовок = "", РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено, Действия = Неопределено) Экспорт
	РабочиеДействия = А1Э_Структуры.Скопировать(Действия);
	//Эти обработчики одинаковы для таблицы и для дерева, не имеет смысла дублировать код.
	А1БК_ТаблицаФормы.ДобавитьФункциональность(МассивОписаний, ИмяКомпонента, РабочиеДействия);
	А1Э_Формы.ДобавитьОписаниеДереваФормы(МассивОписаний, ИмяКомпонента, Колонки, Заголовок, РодительЭлемента, ПередЭлементом, Параметры, РабочиеДействия);
КонецФункции
