#Если НЕ Клиент Тогда

// Показывает пользователю ПолеВыбораНескольких. Данные этого поля записываются в одноименную табличную часть объекта в колонку "Значение".
//
// Параметры:
//  МассивОписаний	 - Массив - 
//  ИмяКомпонента	 - Строка - должно совпадать с именем табличной части объекта
//  Форма			 - ФормаКлиентскогоПриложения - 
//  Заголовок		 - 	 - 
//  РодительЭлемента - 	 - 
//  ПередЭлементом	 - 	 - 
//  Параметры		 - 	 - 
//  Действия		 - 	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ДобавитьОписание(МассивОписаний, ИмяКомпонента, Форма, Заголовок = "", РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено, Действия = Неопределено) Экспорт
	ОписаниеТипов = А1Э_Метаданные.ОписаниеТипаКолонки(Форма.Объект.Ссылка, ИмяКомпонента, "Значение");
	
	РабочиеПараметры = А1Э_Структуры.СкопироватьВШаблон(Параметры,
	"СохраняемыеДанные", Истина,
	);
	РабочиеДействия = А1Э_Структуры.Скопировать(Действия);
	
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаПриСозданииНаСервере", 0);
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаПередЗаписьюНаСервере", 0);
	
	А1БК_ПолеВыбораНескольких.ДобавитьОписание(МассивОписаний, ИмяКомпонента, ОписаниеТипов, Заголовок, РодительЭлемента, ПередЭлементом, РабочиеПараметры, РабочиеДействия);
КонецФункции

	Функция ФормаПриСозданииНаСервере(ИмяКомпонента, Форма, Отказ, СтандартнаяОбработка) Экспорт
		МассивЗначений = Новый Массив;
		Для Каждого Строка Из Форма.Объект[ИмяКомпонента] Цикл
			МассивЗначений.Добавить(Строка.Значение);
		КонецЦикла;
		
		А1БК_ПолеВыбораНескольких.УстановитьЗначение(Форма, ИмяКомпонента, МассивЗначений);
	КонецФункции 	
	
	Функция ФормаПередЗаписьюНаСервере(ИмяКомпонента, Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт 
		МассивЗначений = А1БК_ПолеВыбораНескольких.МассивЗначений(Форма, ИмяКомпонента);
		ТекущийОбъект[ИмяКомпонента].Очистить();
		Для Каждого Значение Из МассивЗначений Цикл
			Строка = ТекущийОбъект[ИмяКомпонента].Добавить();
			Строка.Значение = Значение;
		КонецЦикла;
	КонецФункции
	
#КонецЕсли 

Функция ИмяМодуля() Экспорт
	Возврат "А1БК_ПолеВыбораНесколькихТаблицаОбъекта";
КонецФункции 