//НЕДОДЕЛАНО!

Функция ДобавитьОписание(МассивОписаний, ИмяКомпонента, ИмяРеквизита, ОписаниеТипов, Заголовок = "", РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено, Действия = Неопределено) Экспорт
	РабочиеДействия = А1Э_Структуры.Скопировать(Действия);
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаПриСозданииНаСервере", 0);
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаПередЗаписьюНаСервере", 0);
	
	А1Э_УниверсальнаяФорма.ДобавитьОписаниеНастроекКомпонента(МассивОписаний, ИмяКомпонента);
	Возврат А1Э_Формы.ДобавитьОписаниеЭлемента(МассивОписаний, ИмяКомпонента, ОписаниеТипов, Заголовок, РодительЭлемента, ПередЭлементом, Параметры, РабочиеДействия);
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ФормаПриСозданииНаСервере(ИмяКомпонента, Форма, Отказ, СтандартнаяОбработка) Экспорт  
		Настройки = А1Э_УниверсальнаяФорма.НастройкиКомпонента(Форма, ИмяКомпонента);
	КонецФункции 
	
	Функция ФормаПередЗаписьюНаСервере(ИмяКомпонента, Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт  
		
	КонецФункции 
#КонецЕсли

Функция ИмяМодуля() Экспорт
	Возврат "А1БК_ПолеОбъектаПоИдентификатору";
КонецФункции 