//НЕДОДЕЛАНО!

Функция ДобавитьОписание(МассивОписаний, ИмяКомпонента, ИмяРеквизита, ОписаниеТипов, Заголовок = "", РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено, Действия = Неопределено) Экспорт
	РабочиеДействия = А1Э_Структуры.Скопировать(Действия);
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаПриСозданииНаСервере", 0);
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаПередЗаписьюНаСервере", 0);
	
	А1Э_УниверсальнаяФорма.ДобавитьОписаниеНастроекКомпонента(МассивОписаний, ИмяКомпонента);
	Возврат А1Э_Формы.ДобавитьОписаниеЭлемента(МассивОписаний, ИмяКомпонента, ОписаниеТипов, Заголовок, РодительЭлемента, ПередЭлементом, Параметры, РабочиеДействия);
КонецФункции

Функция ДобавитьОписаниеГиперссылки(МассивОписаний, ИмяКомпонента, Форма, РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено, Действия = Неопределено) Экспорт
	МетаданныеОбъекта = Форма.Объект.Ссылка.Метаданные();
	ИмяРеквизита = А1Э_Общее.ЗначениеСвойства(Параметры, "ИмяРеквизита", ИмяКомпонента);
	Реквизит = МетаданныеОбъекта.Реквизиты[ИмяРеквизита];
	Заголовок = А1Э_Общее.ЗначениеСвойства(Параметры, "Заголовок", Реквизит.Синоним);
	РабочиеДействия = А1Э_Структуры.Скопировать(Действия);
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаПриСозданииНаСервере", 0);
	
	А1Э_УниверсальнаяФорма.ДобавитьОписаниеНастроекКомпонента(МассивОписаний, ИмяКомпонента, А1Э_Структуры.Создать(
	"ИмяРеквизита", ИмяРеквизита,
	));
	
	Возврат А1Э_Формы.ДобавитьОписаниеГиперссылки(МассивОписаний, ИмяКомпонента, "", , Заголовок, РодительЭлемента, ПередЭлементом, Параметры, РабочиеДействия);  
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ФормаПриСозданииНаСервере(ИмяКомпонента, Форма, Отказ, СтандартнаяОбработка) Экспорт  
		Настройки = А1Э_УниверсальнаяФорма.НастройкиКомпонента(Форма, ИмяКомпонента);
		Форма[ИмяКомпонента] = А1Э_Метаданные.СсылкаПоИдентификатору(Форма.Объект[Настройки.ИмяРеквизита]);
	КонецФункции 
	
	Функция ФормаПередЗаписьюНаСервере(ИмяКомпонента, Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт  
		
	КонецФункции 
#КонецЕсли

Функция ИмяМодуля() Экспорт
	Возврат "А1БК_ПолеОбъектаПоИдентификатору";
КонецФункции 