// Механизм создает базовую форму наподобие той, которую создает конфигуратор, когда форма не определена.
// Применяется для прототипизирования и для простых объектов метаданных.
// 
// Возвращаемое значение:
//   - 
//
Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ФормаЭлементаПриСозданииОбъектов", Истина);

	Возврат Настройки;
КонецФункции  

Функция ФормаЭлементаПриСозданииОбъектов(Форма, Отказ, МассивОписаний) Экспорт 
	МетаданныеОбъекта = Форма.Объект.Ссылка.Метаданные();
	ПоляОбъекта = А1Э_Объекты.МассивПолей(МетаданныеОбъекта);
	
	А1БК_ГруппаСКолонками.ДобавитьОписание(МассивОписаний, "ГруппаШапка", ,);
	Для Каждого ИмяПоля Из ПоляОбъекта Цикл
		А1Э_Формы.ДобавитьОписаниеПоляОбъекта(МассивОписаний, ИмяПоля, "ГруппаШапка");
	КонецЦикла;
	Если МетаданныеОбъекта.ТабличныеЧасти.Количество() > 0 Тогда
		А1Э_Формы.ДобавитьОписаниеГруппыСтраниц(МассивОписаний, "ГруппаСтраницыТабличныхЧастей");
		Для Каждого ТабличнаяЧасть Из МетаданныеОбъекта.ТабличныеЧасти Цикл
			А1Э_Формы.ДобавитьОписаниеСтраницы(МассивОписаний, "Страница" + ТабличнаяЧасть.Имя, ТабличнаяЧасть.Синоним, "ГруппаСтраницыТабличныхЧастей");
			А1БК_ТаблицаОбъекта.ДобавитьОписание(МассивОписаний, ТабличнаяЧасть.Имя, Форма, , "Страница" + ТабличнаяЧасть.Имя);
		КонецЦикла;
	КонецЕсли;
КонецФункции 

