#Если НЕ Клиент Тогда
	
	// Добавляет кнопку открытия списка и кнопку создания нового элемента в единой горизонтальной группе.
	//
	// Параметры:
	//  МассивОписаний	 - Массив	 - 
	//  ИмяКомпонента	 - Строка -  
	//  РодительЭлемента - Строка, ЭлементФормы	 - 
	//  ПередЭлементом	 - Строка, ЭлементФормы	 - 
	//  Параметры		 - 	 - 
	// 
	// Возвращаемое значение:
	//   - 
	//
	Функция ДобавитьОписание(МассивОписаний, Знач ИмяКомпонента, РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено) Экспорт
		Если НЕ А1Э_Структуры.Свойство(Параметры, "ИмяМетаданных") Тогда
			ИмяМетаданных = ИмяКомпонента;
			КорневоеИмя = СтрЗаменить(ИмяКомпонента, ".", "___");
		Иначе
			ИмяМетаданных = Параметры.ИмяМетаданных;
			КорневоеИмя = ИмяКомпонента;
		КонецЕсли;
		ОбъектМетаданных = А1Э_Метаданные.ОбъектМетаданных(ИмяМетаданных);
		
		А1Э_УниверсальнаяФорма.ДобавитьОписаниеНастроекКомпонента(МассивОписаний, КорневоеИмя, А1Э_Структуры.Создать(
		"ИмяМетаданных", ИмяМетаданных,
		));
		А1Э_Формы.ДобавитьОписаниеГоризонтальнойГруппы(МассивОписаний, КорневоеИмя, , РодительЭлемента, ПередЭлементом);	
		А1Э_Формы.ДобавитьОписаниеКомандыИКнопки(МассивОписаний, КорневоеИмя + "___ОткрытиеСписка", ИмяМодуля() + ".ОткрытиеСписка", , А1Э_Метаданные.ПредставлениеНескольких(ОбъектМетаданных), КорневоеИмя, , , Параметры);
		А1Э_Формы.ДобавитьОписаниеКомандыИКнопки(МассивОписаний, КорневоеИмя + "___СозданиеНового", ИмяМодуля() + ".СозданиеНового", , , КорневоеИмя, , ,
		А1Э_Структуры.Создать(
		"Картинка", БиблиотекаКартинок.СоздатьЭлементСписка,
		"Отображение", ОтображениеКнопки.Картинка,
		"Ширина", 3,
		));
	КонецФункции 
	
#КонецЕсли

#Если Клиент Тогда
	
	Функция ОткрытиеСписка(Форма, Команда) Экспорт
		 ОткрытьФорму(ИмяМетаданных(Форма, Команда.Имя) + ".ФормаСписка");
	КонецФункции
	
	Функция СозданиеНового(Форма, Команда) Экспорт
		ОткрытьФорму(ИмяМетаданных(Форма, Команда.Имя) + ".ФормаОбъекта");
	КонецФункции 
#КонецЕсли

Функция ИмяМетаданных(Форма, ИмяЭлемента) 
	Возврат  А1Э_УниверсальнаяФорма.НастройкиКомпонента(Форма, А1Э_Строки.ПередСКонца(ИмяЭлемента, "___")).ИмяМетаданных;
КонецФункции

Функция ИмяМодуля() Экспорт
	Возврат "А1БК_НаборКнопокСписка";
КонецФункции 

