Функция ДобавитьОписание(МассивОписаний, ИмяКомпонента, Форма, Колонки, РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено, Действия = Неопределено) Экспорт
	РабочиеКолонки = А1Э_Структуры.Скопировать(Колонки);
	РабочиеПараметры = А1Э_Структуры.Скопировать(Параметры);
	Если А1Э_Общее.Свойство(РабочиеПараметры, "ИтогиВПодвале") Тогда
		РабочиеПараметры.Вставить("Подвал", Истина);
		МассивКолонокСИтогами = А1Э_Массивы.Массив(РабочиеПараметры.ИтогиВПодвале);
		Для Каждого КолонкаСИтогами Из МассивКолонокСИтогами Цикл
			Если РабочиеКолонки.Свойство(КолонкаСИтогами) Тогда
				ОписаниеКолонки = Колонки[КолонкаСИтогами];
			Иначе
				ОписаниеКолонки = Новый Структура;
				РабочиеКолонки.Вставить(КолонкаСИтогами, ОписаниеКолонки);
			КонецЕсли;
			ОписаниеКолонки.Вставить("ПутьКДаннымПодвала", "Объект." + ИмяКомпонента + ".Итог" + КолонкаСИтогами);
		КонецЦикла;
	КонецЕсли;	
	Возврат А1Э_Формы.ДобавитьОписаниеТаблицыОбъекта(Форма, МассивОписаний, ИмяКомпонента, РабочиеКолонки, , РодительЭлемента, ПередЭлементом, РабочиеПараметры, Действия);
КонецФункции 