#Если НЕ Клиент Тогда
	
	Функция ДобавитьОписание(МассивОписаний, ИмяКомпонента, Заголовок = "", Свернута = Истина, РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено, Действия = Неопределено) Экспорт
	А1Э_Формы.ДобавитьОписаниеРеквизита(МассивОписаний, ИмяРеквизитаСвернутость(ИмяКомпонента), "Булево", , , А1Э_Структуры.Создать(
	"ЗначениеРеквизита", Свернута,
	));
	ПараметрыВерхнейГруппы = А1Э_Структуры.Создать(
	"Видимость", Истина, 
	"Доступность", Истина,
	);
	Если Параметры <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(ПараметрыВерхнейГруппы, Параметры);
	КонецЕсли;
	РабочиеДействия = А1Э_Структуры.Скопировать(Действия);
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаОбновитьСвойстваЭлементов");
	А1Э_Формы.ДобавитьОписаниеВертикальнойГруппы(МассивОписаний, ИмяВерхнейГруппы(ИмяКомпонента), "", РодительЭлемента, ПередЭлементом, ПараметрыВерхнейГруппы);
	
	ИмяГруппыЗаголовка = ИмяГруппыЗаголовка(ИмяКомпонента);
	А1Э_Формы.ДобавитьОписаниеГоризонтальнойГруппы(МассивОписаний, ИмяГруппыЗаголовка, "", ИмяВерхнейГруппы(ИмяКомпонента));
	А1Э_Формы.ДобавитьОписаниеДекорации(МассивОписаний, ИмяСтрелкиВниз(ИмяКомпонента), , ИмяГруппыЗаголовка, ,
	А1Э_Структуры.Создать(
	"Вид", ВидДекорацииФормы.Картинка,
	"Картинка", БиблиотекаКартинок.А1БК_СвертываемаяГруппаСтрелкаВниз,
	"Гиперссылка", Истина
	), А1Э_Структуры.Создать(
	"Нажатие", ИмяМодуля() + ".НажатиеИзменитьСвернутость", 
	));
	А1Э_Формы.ДобавитьОписаниеДекорации(МассивОписаний, ИмяСтрелкиВправо(ИмяКомпонента), , ИмяГруппыЗаголовка, ,
	А1Э_Структуры.Создать(
	"Вид", ВидДекорацииФормы.Картинка,
	"Картинка", БиблиотекаКартинок.А1БК_СвертываемаяГруппаСтрелкаВправо,
	"Гиперссылка", Истина,
	), А1Э_Структуры.Создать(
	"Нажатие", ИмяМодуля() + ".НажатиеИзменитьСвернутость", 
	));
	А1Э_Формы.ДобавитьОписаниеДекорации(МассивОписаний, ИмяКомпонента + "___Заголовок", Заголовок, ИмяГруппыЗаголовка, ,
	А1Э_Структуры.Создать(
	"ЦветТекста", ЦветаСтиля.ЦветАкцента,
	"Шрифт", Новый Шрифт(ШрифтыСтиля.ОбычныйШрифтТекста, , 12),
	));
	
	А1Э_Формы.ДобавитьОписаниеГруппы(МассивОписаний, ИмяКомпонента, "", ИмяВерхнейГруппы(ИмяКомпонента), , Параметры, РабочиеДействия);
КонецФункции

#КонецЕсли

Функция ФормаОбновитьСвойстваЭлементов(ИмяКомпонента, Форма) Экспорт
	Элементы = Форма.Элементы;
	Свернута = Форма[ИмяРеквизитаСвернутость(ИмяКомпонента)];
	Элементы[ИмяСтрелкиВниз(ИмяКомпонента)].Видимость = НЕ Свернута;
	Элементы[ИмяСтрелкиВправо(ИмяКомпонента)].Видимость = Свернута;
	Элементы[ИмяКомпонента].Видимость = НЕ Свернута;
КонецФункции

Функция ИзменитьСвернутость(Форма, ИмяКомпонента, Знач Свернутость = Неопределено) Экспорт
	Если Свернутость = Неопределено Тогда
		Свернутость = НЕ Форма[ИмяРеквизитаСвернутость(ИмяКомпонента)];
	КонецЕсли;
	Форма[ИмяРеквизитаСвернутость(ИмяКомпонента)] = НЕ Форма[ИмяРеквизитаСвернутость(ИмяКомпонента)];
	ФормаОбновитьСвойстваЭлементов(ИмяКомпонента, Форма);	
КонецФункции

Функция ИзменитьВидимость(Форма, ИмяКомпонента, Знач Видимость = Неопределено) Экспорт
	Если Видимость = Неопределено Тогда
		Видимость = НЕ Форма.Элементы[ИмяВерхнейГруппы(ИмяКомпонента)].Видимость;
	КонецЕсли;
	Форма.Элементы[ИмяВерхнейГруппы(ИмяКомпонента)].Видимость = Видимость;
КонецФункции

#Если Клиент Тогда
	Функция НажатиеИзменитьСвернутость(Форма, Элемент, СтандартнаяОбработка) Экспорт
		ИмяКомпонента = А1Э_Строки.ПередСКонца(Элемент.Имя, "___");
		ИзменитьСвернутость(Форма, ИмяКомпонента);
	КонецФункции 
#КонецЕсли

Функция ИмяРеквизитаСвернутость(ИмяКомпонента)
	Возврат ИмяКомпонента + "___Свернута";
КонецФункции

Функция ИмяГруппыЗаголовка(ИмяКомпонента)
	Возврат ИмяКомпонента + "___ГруппаЗаголовка";
КонецФункции

Функция ИмяСтрелкиВниз(ИмяКомпонента)
	Возврат ИмяКомпонента + "___СтрелкаВниз";
КонецФункции

Функция ИмяСтрелкиВправо(ИмяКомпонента)
	Возврат ИмяКомпонента + "___СтрелкаВправо";
КонецФункции 

Функция ИмяВерхнейГруппы(ИмяКомпонента) 
	Возврат ИмяКомпонента + "___ВерхняяГруппа";
КонецФункции

Функция ИмяМодуля() Экспорт
	Возврат "А1БК_СвертываемаяГруппа";
КонецФункции 