// Кнопка, которая предназначена для редактирования данных. Если находится в зоне "ТолькоПросмотр", то у неё будет автоматически отключена доступность. 
//
// Параметры:
//  МассивОписаний	 - Массив	 - 
//  ИмяКомпонента	 - Строка - 
//  Действие		 - Строка - 
//  Заголовок		 - Строка - 
//  РодительЭлемента - Строка,ОбъектФормы	 - 
//  ПередЭлементом	 - Строка,ОбъектФормы	 - 
//  Параметры		 - Структура, Неопределено	 - 
//  Действия		 - Структура, Неопределено	 - 
// 
// Возвращаемое значение:
//   - 
//
Функция ДобавитьОписание(МассивОписаний, ИмяКомпонента, Действие, Заголовок = "", РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено, Действия = Неопределено) Экспорт
	//Для программного переопределения доступности.
	А1Э_УниверсальнаяФорма.ДобавитьОписаниеНастроекКомпонента(МассивОписаний, ИмяКомпонента, А1Э_Структуры.Создать(
	"Доступность", Неопределено,
	));
	РабочиеДействия = А1Э_Структуры.Скопировать(Действия);
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаОбновитьСвойстваЭлементов");
	А1Э_Формы.ДобавитьОписаниеКомандыИКнопки2(МассивОписаний, ИмяКомпонента, Действие, Заголовок, РодительЭлемента, ПередЭлементом, Параметры, РабочиеДействия);
КонецФункции

// Аналогично ДобавитьОписание(), но также устанавливает флаг "Модифицированность" при нажатии.
//
// Параметры:
//  МассивОписаний	 - Массив	 - 
//  ИмяКомпонента	 - Строка - 
//  Действие		 - Строка - 
//  Заголовок		 - Строка - 
//  РодительЭлемента - Строка,ОбъектФормы	 - 
//  ПередЭлементом	 - Строка,ОбъектФормы	 - 
//  Параметры		 - Структура, Неопределено	 - 
//  Действия		 - Структура, Неопределено	 - 
//
// Возвращаемое значение:
//   - 
//
Функция ДобавитьОписаниеССохранением(МассивОписаний, ИмяКомпонента, Действие, Заголовок = "", РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено, Действия = Неопределено) Экспорт
	РабочиеПараметры = А1Э_Структуры.СкопироватьВШаблонСЗаменой(Параметры,
	"ИзменяетСохраняемыеДанные", Истина,
	);
	ДобавитьОписание(МассивОписаний, ИмяКомпонента, Действие, Заголовок, , ПередЭлементом, РабочиеПараметры, Действия);
КонецФункции

Функция ФормаОбновитьСвойстваЭлементов(ИмяКомпонента, Форма) Экспорт
	Настройки = А1Э_УниверсальнаяФорма.НастройкиКомпонента(Форма, ИмяКомпонента);
	Кнопка = Форма.Элементы[ИмяКомпонента];
	Если ТипЗнч(Настройки.Доступность) = Тип("Булево") Тогда
		Кнопка.Доступность = Настройки.Доступность;
	Иначе
		Кнопка.Доступность = НЕ А1Э_Формы.ТолькоПросмотрАктивен(Форма, Кнопка);
	КонецЕсли;
КонецФункции

Функция ИмяМодуля() Экспорт
	Возврат "А1БК_КнопкаДанных";
КонецФункции 